import 'package:flutter/material.dart';
import 'package:get/get.dart';

class M3s3opat extends StatefulWidget {
  const M3s3opat({super.key});

  @override
  State<M3s3opat> createState() => _M3s3opatState();
}

class _M3s3opatState extends State<M3s3opat> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: const Color.fromARGB(255, 60, 196, 208),
      appBar: AppBar(
        backgroundColor: const Color.fromARGB(255, 14, 192, 215),
        title: Text(
          '62'.tr,
          textAlign: TextAlign.center,
          style: const TextStyle(fontSize: 23),
        ),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            Container(
              alignment: Alignment.center,
              child: Column(
                mainAxisAlignment: MainAxisAlignment.center,
                children: [
                  Text(
                    m3loma,
                    textAlign: TextAlign.start,
                    style: const TextStyle(
                        fontSize: 23,
                        color: Colors.black,
                        fontWeight: FontWeight.bold),
                  )
                ],
              ),
            )
          ],
        ),
      ),
    );
  }
}

String m3loma =
    'معلومات عن مرض التوحدمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوح'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد';
