import 'package:flutter/material.dart';
import 'package:get/get.dart';

class M3lomat extends StatefulWidget {
  const M3lomat({super.key});

  @override
  State<M3lomat> createState() => _M3lomatState();
}

class _M3lomatState extends State<M3lomat> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: const Color.fromARGB(255, 60, 196, 208),
      appBar: AppBar(
        backgroundColor: const Color.fromARGB(255, 13, 179, 201),
        title: Text(
          '62'.tr,
          style: const TextStyle(fontSize: 23),
          textAlign: TextAlign.center,
        ),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            Container(
              alignment: Alignment.center,
              child: Column(
                mainAxisAlignment: MainAxisAlignment.center,
                children: [
                  Text(
                    m3loma1,
                    textAlign: TextAlign.start,
                    style: const TextStyle(
                        fontSize: 23,
                        color: Colors.black,
                        fontWeight: FontWeight.bold),
                  )
                ],
              ),
            )
          ],
        ),
      ),
    );
  }
}

String m3loma1 =
    'معلومات عن مرض التوحدمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوحمعلومات عن مرض التوح'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد'
    'معلومات عن مرض التوحد';
